# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [12]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [20]:
fser = pd.Series(np.random.randint(1,high =4,size = 100, dtype ='l'))
sser =pd.Series(np.random.randint(1,high =3,size = 100, dtype ='l'))
tser = pd.Series(np.random.randint(10000,high =30000,size = 100, dtype ='l'))
fser

0     2
1     3
2     3
3     3
4     3
     ..
95    3
96    3
97    3
98    2
99    2
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [22]:
d = pd.concat([fser, sser, tser], axis=1)
d

    0  1      2
0   2  2  26232
1   3  2  23659
2   3  1  27633
3   3  2  14170
4   3  1  16546
.. .. ..    ...
95  3  1  14240
96  3  1  22583
97  3  1  19038
98  2  1  24228
99  2  2  25020

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [23]:
d = pd.DataFrame({'bedrs':fser,'bathrs':sser,'sqr_meter':tser})
d

    bedrs  bathrs  sqr_meter
0       2       2      26232
1       3       2      23659
2       3       1      27633
3       3       2      14170
4       3       1      16546
..    ...     ...        ...
95      3       1      14240
96      3       1      22583
97      3       1      19038
98      2       1      24228
99      2       2      25020

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [28]:
bigcolumn =pd.concat([fser,sser,tser],axis=0)
bigcolumn =bigcolumn.to_frame()
bigcolumn

        0
0       2
1       3
2       3
3       3
4       3
..    ...
95  14240
96  22583
97  19038
98  24228
99  25020

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [32]:
bigcolumn.value_counts().sum()

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [33]:
bigcolumn.reset_index()

     index      0
0        0      2
1        1      3
2        2      3
3        3      3
4        4      3
..     ...    ...
295     95  14240
296     96  22583
297     97  19038
298     98  24228
299     99  25020

[300 rows x 2 columns]